Dataset/Advanced/wedge_SA/GT_Files/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     | Website:  https://openfoam.org
|   \\  /    A nd           | Version:  10
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    bottom
    {
        type            symmetryPlane;   // Correct boundary condition
    }

    top
    {
        type            symmetryPlane;   // Correct boundary condition
    }

    obstacle
    {
        type            calculated;    // ✅ Replaced nutkWallFunction with calculated
        value           uniform 0;     // Placeholder (required even if not used)
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //

